#!/usr/bin/env python
# -*- coding: utf-8 -*-

font_size=36
width=50
height=50
back_ground_color=(255,255,255)
font_color=(0,0,0)


#name for the image files
fileNames = ['1-ka','2-kha','3-ga','4-gha','5-nga',
             '6-cha','7-chha','8-ja','9-jha','10-yna',
             '11-Ta','12-Tha','13-Da','14-Dha','15-Na',
             '16-ta','17-tha','18-da','19-dha', '20-na',
             '21-pa','22-fa','23-ba','24-bha','25-ma',
             '25-ya','26-ra','27-la','28-yo',
             '30-sha','31-psha','32-sa','33-ha',
             '34-ksya','35-tra','36-gya'
             ]

#reference
# क ख ग घ ङ
# च छ ज झ ञ
# ट ठ ड ढ ण
# त थ द ध न
# प फ ब भ म
# य र ल व
# श ष स ह
# क्ष त्र ज्ञ


#list of all the filenames as key and its corresponding unicodes as value
fontFiles = {
    "agra.ttf"      : [ 'd', 'Â', 'x', 'Ä', '³',
                        'p', 'N', 't', ' ', '´',
                        'V', 'B', 'M', '<', 'Æ',
                        'r', 'É', 'n', '', 'u',
                        'i', 'Q', 'c', '','e',
                        '', 'j', 'y', 'o',
                        '', '', 'l', 'g',
                        '', '', '',
                        ],
    "arjun.ttf"     : ['d  ', '', 'x ', '', '³',
                       'p', 'N   ', 't', '>', '´',
                       '', 'B', 'M', '<', '',
                       'r', '', 'n', '', 'u',
                       'i', 'Q', 'c', '', 'e ',
                       ';', 'j', 'y', 'o',
                       '', '', 'l', 'g',
                       '', '', 'K',
                        ],
    "amaa.ttf"      : ['s', 'v', 'u', '3', 'ª',
                       'r', '5', 'h', '´', '',
                       '6', '7', '8', '9', '',
                       't', 'y', 'b', 'w', 'g',
                       'k', '˚    ', 'a', 'e', 'd ',
                       'o', '', 'n', 'j  ',
                       'z', 'È', ';', 'x',
                       'Ô', 'q', '1 ',
                       ],
    "bharat.ttf"    : ['k', 'K', 'g', 'G', 'ˆ',
                       'c', 'C', 'j', 'J', '‰',
                       'Š', '‹', 'Œ', 'š', 'N',
                       't', 'T', 'd', 'D', 'n',
                       'p', 'f', 'b', 'B', 'm',
                       'y', 'r', 'l', 'v',
                       'S', 'P', 's', 'h',
                       'x', 'q', 'Y'
                       ],
    "dev.ttf"       : ['s', 'v', 'u', '3', 'ª',
                       'r', '5', 'h', '´', '`',
                       '6', '7', '8', '9', '',
                       't', 'y', 'b', 'w', 'g',
                       'k', '©', 'a', 'e', 'd',
                       'o', '/', 'n', 'j',
                       'z', '', ';', 'x',
                       '', '', '1'
                       ],
    "devnew.ttf"    : ['k', '%', 'g', '`', '',
                       'c', '^', 'j', '&', '',
                       '$', '#', '@', '!', ',',
                       't', 'q', 'd', '/', 'n',
                       'p', 'f', 'b', '.', 'm',
                       'y', 'r', 'l', 'v',
                       'x', 'z', 's', 'h',
                       '', ']', 'D'
                       ],
    "himali.ttf"    : ['a', 'b', 'c', 'd', 'Ð',
                       'é', 'F', 'g', 'H', 'i',
                       'Ì', 'Î', 'ï', 'j', 'k',
                       'l', 'n', 'Ñ', 'ò', 'ô',
                       'ö', 'õ', 'ø', '', 'p',
                       'q', 'š', 'u', 'ú',
                       'ù', 'ü', 'v', 'W',
                       'y', 'ý', 'z'
                       ]
}